       IDENTIFICATION DIVISION.
       PROGRAM-ID. example-success.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-RESULT PIC X(4) VALUE 'TRUE'.
       PROCEDURE DIVISION.