       IDENTIFICATION DIVISION.
       PROGRAM-ID. example-syntax-error.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
This is not cobol syntax!!!
       PROCEDURE DIVISION.